ОсновныеОбъектыЗанятие6/src/InformationRegisters/ОтносительныеКурсыВалют/ОтносительныеКурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтносительныеКурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КурсЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БазоваяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ОсновныеОбъектыЗанятие6/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <predefined>
    <items>
      <name>НациональнаяВалюта</name>
      <description>Национальная валюта</description>
    </items>
  </predefined>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКурса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Catalog>

ОсновныеОбъектыЗанятие6/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Неприкасаемые</name>
      <description>Неприкасаемые</description>
    </items>
    <items>
      <name>Принятые</name>
      <description>Принятые</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаОклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТрудоваяКнижка</name>
    <attributes>
      <name>МестоРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУвольнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ОсновныеОбъектыЗанятие6/src/CommonModules/НаСервереМожноВызватьСКлиента/Module.bsl
Функция ПолучитьНаименованиеОрганизации() Экспорт 

	Возврат Константы.НазваниеОрганизации.Получить();

КонецФункции // ПолучитьНаименованиеОрганизации()


Функция ЗаполнитьКурсВалютыНаДату(Данные) Экспорт
	
	СсылкаНаВалюту = Справочники.Валюты.НайтиПоКоду(Данные.КодВалюты);

	Если ЗначениеЗаполнено(СсылкаНаВалюту) Тогда

		ЗаписьРегистраСведений = РегистрыСведений.ОтносительныеКурсыВалют.СоздатьМенеджерЗаписи();
		ЗаписьРегистраСведений.Период = Данные.Дата;
		ЗаписьРегистраСведений.Валюта = СсылкаНаВалюту;
		ЗаписьРегистраСведений.БазоваяВалюта = Справочники.Валюты.НациональнаяВалюта;
		ЗаписьРегистраСведений.КурсЧислитель = Данные.КурсЧислитель;
		ЗаписьРегистраСведений.КурсЗнаменатель = ?(Данные.КурсЗнаменатель = 0, 1, Данные.КурсЗнаменатель);
		ЗаписьРегистраСведений.Ответственный = Справочники.Сотрудники.НайтиПоНаименованию(Данные.ФИО, Ложь);

		ЗаписьРегистраСведений.Записать();

		СпрВалютыОбъект = СсылкаНаВалюту.ПолучитьОбъект();
		СпрВалютыОбъект.БазоваяВалюта = Справочники.Валюты.НациональнаяВалюта;
		СпрВалютыОбъект.КурсЧислитель = Данные.КурсЧислитель;
		СпрВалютыОбъект.КурсЗнаменатель = Данные.КурсЗнаменатель;
		СпрВалютыОбъект.ДатаКурса = Данные.Дата;
		СпрВалютыОбъект.Записать();
		
		Возврат СсылкаНаВалюту.БуквенныйКод;

	КонецЕсли;

КонецФункции


Процедура ЗаменитьОтветственного(СтарыйОтветственный, НовыйОтветственный) Экспорт 

	 Выборка = Справочники.Склады.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 
	 	   Если Выборка.Ответственный = СтарыйОтветственный Тогда
				 
				 СкладОбъект = Выборка.ПолучитьОбъект();
				 
				 СкладОбъект.Ответственный = НовыйОтветственный;
				 
				 СкладОбъект.Записать();
			 
			 КонецЕсли;
	 
	 КонецЦикла;

КонецПроцедуры

Функция ПолучитьСписокДолжностей(Подразделение) Экспорт
	
		МассивДолжностей = Новый Массив;
	
	ТЧДолжности = Подразделение.Должности;
	
	Для Каждого ТекСтрока Из ТЧДолжности Цикл
		
		МассивДолжностей.Добавить(ТекСтрока.Должность.Наименование);
		
	КонецЦикла;
	
	Возврат МассивДолжностей;
	
КонецФункции

Функция ПолучитьСписокПредыдущихМестРаботыСотрудника(Сотрудник) Экспорт

	Массив = Новый Массив();	
	
	Для Каждого ТекСтрока Из Сотрудник.ТрудоваяКнижка Цикл
		
		Массив.Добавить(ТекСтрока.МестоРаботы);
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Функция ПолучитьСписокКонтактныхЛицКонтрагента(Контрагент) Экспорт
	
	Массив = Новый Массив();
	
	ВыборкаКонтактныеЛица = Справочники.КонтактныеЛица.Выбрать(,Контрагент);
	
	Пока ВыборкаКонтактныеЛица.Следующий() = Истина Цикл
		
		Массив.Добавить(ВыборкаКонтактныеЛица.Наименование);
		
	КонецЦикла;
	
	Возврат Массив;
	
	
КонецФункции

// Установить цену.
// 
// Параметры:
//  Параметры - Структура
// Ключи: Номенклатура, Контрагент, Цена, Дата
Процедура УстановитьЦену(Параметры) Экспорт
	
	Возврат; //Это регистр теперь подчинен регистратору
	
//	ЗаписьРегистраСведений = РегистрыСведений.НашиЦены.СоздатьМенеджерЗаписи();
//	ЗаписьРегистраСведений.Период = Параметры.Дата;
//	ЗаписьРегистраСведений.Номенклатура = Параметры.Номенклатура;
//	ЗаписьРегистраСведений.Контрагент = Параметры.Контрагент;
//	ЗаписьРегистраСведений.Цена = Параметры.Цена;
//
//	ЗаписьРегистраСведений.Записать();
	
КонецПроцедуры

// Описание
// 
// Параметры:
// 	СсылкаНаВалюту - СправочникСсылка - Ссылка на справочник "Валюты"
// 	Дата - Дата
// Возвращаемое значение:
// 	Структура - Описание:
// * Курс - Число - 
// * Кратность - Число -
Функция ПолучитьАктуальныеДанныеПоВалюте(СсылкаНаВалюту, Дата) Экспорт

	Вернем = Новый Структура;

	Вернем.Вставить("КурсЧислитель", 0);

	Вернем.Вставить("КурсЗнаменатель", 0);


	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтносительныеКурсыВалютСрезПоследних.КурсЧислитель,
	|	ОтносительныеКурсыВалютСрезПоследних.КурсЗнаменатель
	|ИЗ
	|	РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&Дата, Валюта = &СсылкаНаВалюту
	|	И БазоваяВалюта = &НациональнаяВалюта) КАК ОтносительныеКурсыВалютСрезПоследних";

	Запрос.УстановитьПараметр("СсылкаНаВалюту", СсылкаНаВалюту);
	Запрос.УстановитьПараметр("НациональнаяВалюта", Справочники.Валюты.НациональнаяВалюта);
	Запрос.УстановитьПараметр("Дата", Дата);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если (ВыборкаДетальныеЗаписи.Следующий() = Истина) Тогда

		Вернем.КурсЧислитель = ВыборкаДетальныеЗаписи.КурсЧислитель;

		Вернем.КурсЗнаменатель = ВыборкаДетальныеЗаписи.КурсЗнаменатель;

	КонецЕсли;

	Возврат Вернем;

КонецФункции // ПолучитьАктуальныеДанныеПоВалюте()
